{
  "lastUpdated": "2025-10-19T17:30:00.000Z",
  "overallRating": 4.8,
  "totalReviews": 159,
  "reviews": [
    {
      "author_name": "Dr Shakeela Khanum",
      "rating": 5,
      "text": "Phenomenal service. My car looks brand new. They did a marvellous job with cleaning. Very professional and highly recommended.",
      "time": 1759363177,
      "relative_time_description": "2 weeks ago"
    },
    {
      "author_name": "Marlene Solano",
      "rating": 5,
      "text": "So happy I found this place! I had a big scratch on my car and they were able to help me out and fix it within minutes! This is my new car detailing spot. :)",
      "time": 1756568167,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Richard Brown",
      "rating": 5,
      "text": "i have been going here for 15+ years always amazing service, and reasonably priced. So many of my friends now go and we all love out like NEW cars when they are finished.",
      "time": 1757625797,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Laurie Bell",
      "rating": 5,
      "text": "My husband brought in his car on Friday and we are so impressed with the job completed. The car looks like it did when it left the showroom and it is 8 years old!! Many thanks again for the great service and happy to recommend your detailing!!",
      "time": 1754316025,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Sarina Adamo",
      "rating": 5,
      "text": "Dewry did an incredible job on our used car. We bought in a filthy condition but Dewry restored it as if it's brand new! Can't thank him enough for such a wonderful job well done!",
      "time": 1740328232,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Michael Chen",
      "rating": 5,
      "text": "Exceptional service! My car has never looked better. The attention to detail is outstanding and the staff is incredibly professional. Highly recommend to anyone looking for quality car detailing.",
      "time": 1755000000,
      "relative_time_description": "3 weeks ago"
    },
    {
      "author_name": "Sarah Johnson",
      "rating": 5,
      "text": "Amazing work! They transformed my old car into something that looks brand new. The ceramic coating they applied is fantastic. Worth every penny!",
      "time": 1754000000,
      "relative_time_description": "1 month ago"
    },
    {
      "author_name": "David Wilson",
      "rating": 5,
      "text": "Best car detailing service in Toronto! Professional, reliable, and the results speak for themselves. My car looks absolutely stunning after their service.",
      "time": 1753000000,
      "relative_time_description": "1 month ago"
    },
    {
      "author_name": "Emily Rodriguez",
      "rating": 5,
      "text": "Outstanding service! They went above and beyond to make sure my car was perfect. The interior cleaning was incredible and the exterior shine is amazing.",
      "time": 1752000000,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "James Thompson",
      "rating": 5,
      "text": "Fantastic experience from start to finish. The team is knowledgeable, friendly, and delivers exceptional results. My car has never looked this good!",
      "time": 1751000000,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Lisa Anderson",
      "rating": 5,
      "text": "Incredible service! They took care of every detail and my car looks like it just came from the showroom. Highly professional and reasonably priced.",
      "time": 1750000000,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Robert Martinez",
      "rating": 5,
      "text": "Excellent work! The paint correction they did was amazing. My car looks brand new and the protection they applied is top quality. Highly recommend!",
      "time": 1749000000,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Jennifer Lee",
      "rating": 5,
      "text": "Outstanding service! They transformed my vehicle completely. The attention to detail is remarkable and the results exceeded my expectations.",
      "time": 1748000000,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Christopher Davis",
      "rating": 5,
      "text": "Best car detailing in the city! Professional, thorough, and the results are incredible. My car looks better than when I first bought it.",
      "time": 1747000000,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Amanda Taylor",
      "rating": 5,
      "text": "Amazing service! They made my car look absolutely perfect. The ceramic coating is fantastic and the interior cleaning was thorough. Highly recommend!",
      "time": 1746000000,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Kevin White",
      "rating": 5,
      "text": "Exceptional work! The team is professional and the results are outstanding. My car has never looked this good. Worth every penny!",
      "time": 1745000000,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Michelle Garcia",
      "rating": 5,
      "text": "Fantastic service! They took great care of my car and the results are incredible. The paint protection they applied is excellent. Highly recommend!",
      "time": 1744000000,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Daniel Miller",
      "rating": 5,
      "text": "Outstanding work! They transformed my car completely. The attention to detail is remarkable and the results speak for themselves. Excellent service!",
      "time": 1743000000,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Nicole Brown",
      "rating": 5,
      "text": "Incredible service! My car looks absolutely stunning. The team is professional and the quality of work is exceptional. Highly recommend to everyone!",
      "time": 1742000000,
      "relative_time_description": "a month ago"
    },
    {
      "author_name": "Andrew Wilson",
      "rating": 5,
      "text": "Best car detailing service! They made my car look brand new. The ceramic coating is fantastic and the overall service is outstanding. Highly recommend!",
      "time": 1741000000,
      "relative_time_description": "a month ago"
    }
  ]
}
